import React from "react";

const MovieFigureIcon = () => {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="34.108"
      height="48.737"
      viewBox="157.446 440 87.108 48.737"
    >
      <g data-name="그룹 18893">
        <g data-name="그룹 18891">
          <path
            d="M196.994 440.021a14.601 14.601 0 0 0-10.437 4.38 14.603 14.603 0 0 1 4.212 10.268 6.226 6.226 0 0 1 12.452 0v34.068h8.422V454.67c-.009-8.086-6.562-14.639-14.649-14.648"
            fill="#ffc843"
            fillRule="evenodd"
            data-name="패스 7803"
          />
          <path
            d="M176.119 440.021a14.561 14.561 0 0 0-8.456 2.694 8.21 8.21 0 0 1 2.231 5.63v6.324a6.226 6.226 0 0 1 12.452 0 14.601 14.601 0 0 1 4.211-10.268 14.602 14.602 0 0 0-10.438-4.38"
            fill="#da3ab3"
            fillRule="evenodd"
            data-name="패스 7804"
          />
          <path
            d="M186.557 444.4a14.601 14.601 0 0 0-4.21 10.269v34.068h8.422V454.67a14.603 14.603 0 0 0-4.212-10.268"
            fill="#da2d2f"
            fillRule="evenodd"
            data-name="패스 7805"
          />
          <path
            d="M161.658 440.11h-4.212v8.423h4.024v6.136a14.642 14.642 0 0 1 6.192-11.954 8.215 8.215 0 0 0-6.005-2.605"
            fill="#00b3e3"
            fillRule="evenodd"
            data-name="패스 7806"
          />
          <path
            d="M167.662 442.715a14.64 14.64 0 0 0-6.19 11.954v34.068h8.421V448.345a8.204 8.204 0 0 0-2.231-5.631"
            fill="#00299f"
            fillRule="evenodd"
            data-name="패스 7807"
          />
        </g>
        <g data-name="그룹 18892">
          <path
            d="M212.822 440v8.423h3.164v40.294h8.422V468.57h-8.422v-8.423h8.422v-11.724h-11.586V440"
            fill="#ffc843"
            fillRule="evenodd"
            data-name="패스 7808"
          />
          <path
            d="M230.27 440h-13.735a7.882 7.882 0 0 1 7.873 7.872v.55h5.862a5.863 5.863 0 0 1 0 11.724h-5.862v8.423h5.862c7.89 0 14.284-6.396 14.284-14.285S238.159 440 230.27 440"
            fill="#05ce7c"
            fillRule="evenodd"
            data-name="패스 7809"
          />
          <path
            d="M216.536 440h-3.714v8.423h11.586v-.55a7.881 7.881 0 0 0-7.872-7.872m7.872 20.146h-8.422v8.422h8.422v-8.422"
            fill="#05a221"
            fillRule="evenodd"
            data-name="패스 7810"
          />
        </g>
      </g>
    </svg>
  );
};

export default MovieFigureIcon;
